# ЭКЗАМЕН - ТЕСТ: https://itproger.com/test/python
# Тест на знание основ Python

# Задания: 1 | 10
# Сколько библиотек можно импортировать в один проект?

# Неограниченное количество

# - - - - - - - - - - - - - - - - - - - - - - - - - - - 

# Задания: 2 | 10
# Что будет результатом этого кода?
# x = 23
# num = 0 if x > 10 else 11
# print(num)

# 0

# - - - - - - - - - - - - - - - - - - - - - - - - - - - 

# Задания: 3 | 10
# Как получить данные от пользователя?

# Использовать метод input()

# - - - - - - - - - - - - - - - - - - - - - - - - - - - 

# Задания: 4 | 10
# Что покажет этот код?
# for i in range(5):
#   if i % 2 == 0:
#     continue
#   print(i)

# Числа: 1 и 3

# - - - - - - - - - - - - - - - - - - - - - - - - - - - 

# Задания: 5 | 10
# Какая функция выводит что-либо в консоль?

# print();

# - - - - - - - - - - - - - - - - - - - - - - - - - - - 

# Задания: 6 | 10
# Какие ошибки допущены в коде ниже?
# def factorial(n):
#   if n == 0:
#     return 1
#   else:
#     return n * factorial(n - 1)
# print(factorial(5))

# В коде нет никаких ошибок

# - - - - - - - - - - - - - - - - - - - - - - - - - - - 

# Задания: 7 | 10
# Что покажет этот код?
# for j in 'Hi! I\'m mister Robert':
# 	 if j == '\'':
# 	   print("Найдено")
#           break
# else:
# 	print ("Готово")

# "Найдено"

# - - - - - - - - - - - - - - - - - - - - - - - - - - - 

# Задания: 8 | 10
# Где правильно создана переменная?
# * Мы спрашиваем про вариант ответа, который не выдаст ошибку при запуске проекта
# num = float(2)

# - - - - - - - - - - - - - - - - - - - - - - - - - - - 

# Задания: 9 | 10
# Что будет показано в результате?
# name = "John"
# print('Hi, %s' % name)

# "Hi, John"

# - - - - - - - - - - - - - - - - - - - - - - - - - - - 

# Задания: 10 | 10
# Какая библиотека отвечает за время?

# time

# - - - - - - - - - - - - - - - - - - - - - - - - - - - 